
#include "BLINK.h"



#define COUNT_TIMER 125    // значение счетчика таймера для прерывания COUNT_TIMER 125 ~ каждые 1mc
#define BLINK_PORT 	PORTD
#define BLINK_DDR 	DDRD 
#define LED_PIN		PIND
#define BLINK_LED 	6	
#define BLINK 	500	
volatile unsigned int CountBlink =BLINK;  // Интервал 500*0,001 сек = 0,5 сек => 500mc





/********************************************************************
* Обработчик прерывания таймера по совпадению
*********************************************************************/

ISR(TIMER0_COMP_vect)		//Обработчик прерывания таймера по совпадению
	{
	cli();	//запрещаем прерывания
	
	if (CountBlink == 0)
		{
			InvBit(BLINK_PORT, BLINK_LED);		// #define   InvBit(reg, bit)  reg ^= (1<<bit) ИНВЕРТИРОВАТЬ БИТ
            CountBlink =BLINK; 
		}
	 
	CountBlink --;
	asm ("nop");
	sei();					// разрешаем прерывание
	};




/********************************************************************
* 	Основной цикл
*********************************************************************/

int main(void)
{
    Init_Port();		//Инициализация портов
	Init_TIMER0_COMP(); //Инициализация таймера по совпадению
	OCR0 = COUNT_TIMER; //Заносим регистр значение счетчика
    TCNT0 =0;			//Сбрасываем таймер
    sei();				// Общее разрешение прерываний
	while(1)
	{
		
		
	}


}


	

/********************************************************************
* 	ИНИЦИАЛИЗАЦИЯ ПОРТОВ
*********************************************************************/
void Init_Port(void)
{
	
	SetBit(BLINK_DDR, BLINK_LED); // БИТ 6 ПОРТА D НА ВЫХОД
	SetBit(BLINK_PORT, BLINK_LED); //УСТАНАВЛИВАЕМ В БИТЕ 6 ПОРТА D 1 
}
	

