#include "TIMER.h"

//	0,001 сек (10-3 сек)		миллисекунда	мс	ms
//	0,000001 сек (10-6 сек)		микросекунда	мкс	µs
//	0,000000009 сек ()10-9 сек)	наносекунда		нс	ns

/********************************************************************
* 	Инициализация таймера
*********************************************************************/
void Init_TIMER0_COMP(void)
{
	//=========================================================
	//  Т А Й М Е Р  Т0	 (Циклический отсчет 10 ms)
	//	Режим CTC	WGM01=1, WGM00=0;
	//	(1/1.000.000)*8(ПРЕСКАЛЕР)=0,000008 тактов в сек

	//	0.001 sec/0,000008 тактов = 125 тактов в 1ms - #define COUNT_TIMER 8 или 79 тактов в 10mc
	//	
	//=========================================================
//			  7       6       5       4       3      2        1	
//	TCCR0 = FOC00 | WGM00 | COM01 | COM00 | CS02 | CS01 |	CS00

	//CS02,CS01,CS00 ПРЕСКАЛЕР 101 -1024; 001 -0; 010 -8; 011 -64; 100 -256
	//(1<<WGM01) | (0<<WGM00) CTC РЕЖИМ
	TCCR0 |=(0<<CS02)|(1<<CS01)|(0<<CS00)|(1<<WGM01)|(0<<WGM00);  	
																			


//TIMSK 
	//; TOIE01- РАЗРЕШАЕТ ПРЕРЫВАНИЕ ПО ПЕРЕПОЛНЕНИЮ, 0- ЗАПРЕЩАЕТ / OCIE0 1- РАЗРЕШАЕТ ПРЕРЫВАНИЕ ПО СОВПАДЕНИЮ, 0- ЗАПРЕЩАЕТ
	TIMSK |=(0<<TOIE0)|(1<<OCIE0); 
	
    TIFR |= (1<<OCF0)|(0<<TOV0);
};

